Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.CannotCreateAnalyticalGeometry Property
 Cannot construct Analytical Geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateAnalyticalGeometry { get; }
Public Shared ReadOnly Property CannotCreateAnalyticalGeometry As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateAnalyticalGeometry {
	FailureDefinitionId^ get ();
}
static member CannotCreateAnalyticalGeometry : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace